// colors.js
const predefinedColors = [
    '#b8b2e2', // Сиреневый
    '#c9e7d5', // Светло-зеленый
    '#f5eaa9', // Желтый
    '#d6dce3', // Светло-серый
    '#f5cbc9', // Розовый
    '#b7e0d8', // Голубой
    '#e1ecba', // Светло-желтый
    '#c6d9f3', // Светло-синий
    '#e8ceef', // Светло-сиреневый
    '#a3d9a5', // Зеленый
    '#f9a3b1', // Розовый
    '#d1e0e0', // Голубой
    '#f7d794', // Желтый
    '#b8b2e2', // Сиреневый
    '#c9e7d5', // Светло-зеленый
    '#f5eaa9', // Желтый
    '#d6dce3', // Светло-серый
    '#f5cbc9', // Розовый
    '#b7e0d8', // Голубой
    '#e1ecba', // Светло-желтый
    '#c6d9f3', // Светло-синий
    '#e8ceef', // Светло-сиреневый
    '#a3d9a5', // Зеленый
    '#f9a3b1', // Розовый
    '#d1e0e0', // Голубой
    '#f7d794', // Желтый
    '#b8b2e2', // Сиреневый
    '#c9e7d5', // Светло-зеленый
    '#f5eaa9', // Желтый
    '#d6dce3', // Светло-серый
    '#f5cbc9', // Розовый
    '#b7e0d8', // Голубой
    '#e1ecba', // Светло-желтый
    '#c6d9f3', // Светло-синий
    '#e8ceef', // Светло-сиреневый
    '#a3d9a5', // Зеленый
    '#f9a3b1', // Розовый
    '#d1e0e0', // Голубой
    '#f7d794', // Желтый
  ];
  
  module.exports = predefinedColors;